Revit 2024 API
DatumPlane.CanBeVisibleInView Method
 Checks if the datum plane can be visible in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool CanBeVisibleInView(
	View view
)
Visual Basic
Public Function CanBeVisibleInView ( _
	view As View _
) As Boolean
Visual C++
public:
bool CanBeVisibleInView(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view.
Return Value
 True if visible, false otherwise.
Remarks
 This method determines if the orientation of the DatumPlane and View allows that the DatumPlane can be seen in the indicated view. It does not actually determine if the DatumPlane is visible, as many factors can affect the visibility of an element in a given view (for example, hiding the element).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DatumPlane Class
Autodesk.Revit.DB Namespace